app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
 def index
  @products = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
def show
  @product = Product.find(params[:id])

INSERT INTO "products" ("name", "description", "price", "image", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "kwjw"], ["description", "jssh"], ["price", 6664], ["image", nil], ["stock", 664], ["created_at", "2024-09-11 18:20:01.901080"], ["updated_at", "2024-09-11 18:20:01.901080"]]
---
 def create
  @product = Product.new(product_params)

  if @product.save

UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2024-09-12 05:26:58.322454"], ["id", 6]]
---
def update
  @product = Product.find(params[:id])
  if @product.update(product_params)