app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "address", "role", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def signup
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sofia@gmail.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])